contiki-os/contiki/cc26xxware/inc/hw_ioc.h
// Field: [28:27] WU_CFG
//
// If DIO is configured GPIO or non-AON peripheral signals, i.e. PORT_ID 0x00 or
// >0x08:
//
// 00: No wake-up
// 01: No wake-up
// 10: Wakes up from shutdown if this pad is going low.
// 11: Wakes up from shutdown if this pad is going high.
//
// If IO is configured for AON peripheral signals or AUX  ie. PORT_ID
// 0x01-0x08, this register only sets wakeup enable or not.
//
// 00, 01: Wakeup disabled
// 10, 11: Wakeup enabled
//
// Polarity is controlled from AON registers.
//
// Note:When the MSB is set, the IOC will deactivate the output enable for the
// DIO.
#define IOC_IOCFG3_WU_CFG_M                                         0x18000000
#define IOC_IOCFG3_WU_CFG_S                                         27

// Field: [26:24] IOMODE
//
// IO Mode
// N/A for IO configured for AON periph. signals and AUX  ie. PORT_ID
// 0x01-0x08
// AUX has its own open_source/drain configuration.
//
// 0x2: Reserved. Undefined behavior.
// 0x3: Reserved. Undefined behavior.
//
// ENUMs:
// NORMAL               Normal input / output
//
// INTERNAL_NOTE:
// DIN_core=DIN_dio
// DOUT_dio=DOUT_core
// INV                  Inverted input / ouput
//
// INTERNAL_NOTE:
// DIN_core=not(DIN_dio)
// DOUT_dio=not(DOUT_core)
// OPENDR               Open Drain,
// Normal input / output
//
// INTERNAL_NOTE:
// DOE_dio = (not DOUT_core) and DOE_core
// DOUT_dio = 0
// DIN_core = DIN_dio
// OPENDR_INV           Open Drain
// Inverted input / output
//
// INTERNAL_NOTE:
// DOE_dio = DOUT_core and DOE_core
// DOUT_dio = 0,
// DIN_core = not (DIN_dio)
// OPENSRC              Open Source
// Normal input / output
//
// INTERNAL_NOTE:
// DOE_dio = DOUT_core and DOE_core
// DOUT_dio = 1,
// DIN_core =  DIN_dio
// OPENSRC_INV          Open Source
// Inverted input / output
//
// INTERNAL_NOTE:
// DOE_dio = (not DOUT_core) and DOE_core
// DOUT_dio = 1
// DIN_core = (not DIN_dio)
//
#define IOC_IOCFG3_IOMODE_M                                         0x07000000
#define IOC_IOCFG3_IOMODE_S                                         24
#define IOC_IOCFG3_IOMODE_NORMAL                                    0x00000000
#define IOC_IOCFG3_IOMODE_INV                                       0x01000000
#define IOC_IOCFG3_IOMODE_OPENDR                                    0x04000000
#define IOC_IOCFG3_IOMODE_OPENDR_INV                                0x05000000
#define IOC_IOCFG3_IOMODE_OPENSRC                                   0x06000000
#define IOC_IOCFG3_IOMODE_OPENSRC_INV                               0x07000000

// Field: [18]    EDGE_IRQ_EN
//
// 0: No interrupt generation
// 1: Enable interrupt generation for this IO (Only effective if EDGE_DET is
// enabled)
//
//
#define IOC_IOCFG3_EDGE_IRQ_EN                                      0x00040000
#define IOC_IOCFG3_EDGE_IRQ_EN_BITN                                 18
#define IOC_IOCFG3_EDGE_IRQ_EN_M                                    0x00040000
#define IOC_IOCFG3_EDGE_IRQ_EN_S                                    18

// Field: [17:16] EDGE_DET
//
// Enable generation of edge detection events on this IO
//
//
// ENUMs:
// NONE                 No edge detection
// NEG                  Negative edge detection
// POS                  Positive edge detection
// BOTH                 Positive and negative edge detection
//
#define IOC_IOCFG3_EDGE_DET_M                                       0x00030000
#define IOC_IOCFG3_EDGE_DET_S                                       16
#define IOC_IOCFG3_EDGE_DET_NONE                                    0x00000000
#define IOC_IOCFG3_EDGE_DET_NEG                                     0x00010000
#define IOC_IOCFG3_EDGE_DET_POS                                     0x00020000
#define IOC_IOCFG3_EDGE_DET_BOTH                                    0x00030000

// Field: [14:13] PULL_CTL
//
// Pull control
// ENUMs:
// DWN                  Pull down
// UP                   Pull up
// DIS                  No pull
//
#define IOC_IOCFG3_PULL_CTL_M                                       0x00006000
#define IOC_IOCFG3_PULL_CTL_S                                       13
#define IOC_IOCFG3_PULL_CTL_DWN                                     0x00002000
#define IOC_IOCFG3_PULL_CTL_UP                                      0x00004000
#define IOC_IOCFG3_PULL_CTL_DIS                                     0x00006000

// Field: [12]    SLEW_RED
//
// 0: Normal slew rate
// 1: Enables reduced slew rate in output driver.
//
#define IOC_IOCFG3_SLEW_RED                                         0x00001000
#define IOC_IOCFG3_SLEW_RED_BITN                                    12
#define IOC_IOCFG3_SLEW_RED_M                                       0x00001000
#define IOC_IOCFG3_SLEW_RED_S                                       12

// Field: [11:10] IOCURR
//
// Selects IO current in combination with IOSTR
//
//
// ENUMs:
// 2MA                  2 mA
//
// INTERNAL_NOTE:
// Sets IO_EC,IO_HC= 00
// 4MA                  4 mA
//
// INTERNAL_NOTE:
// Sets IO_EC,IO_HC= 01
// 4_8MA                4 or 8 mA
// 8 mA if IO is double drive strength
//
// INTERNAL_NOTE:
// Sets IO_EC,IO_HC= 11
// The double bonded pads are marked as yellow in [IOC Configurator, Supported
// packages
// tab](https://spsemea.itg.ti.com/sites/lpw/proj/CC26xx/Modules/MCU_IOC/IOC%20Configurator.xlsx)
//
#define IOC_IOCFG3_IOCURR_M                                         0x00000C00
#define IOC_IOCFG3_IOCURR_S                                         10
#define IOC_IOCFG3_IOCURR_2MA                                       0x00000000
#define IOC_IOCFG3_IOCURR_4MA                                       0x00000400
#define IOC_IOCFG3_IOCURR_4_8MA                                     0x00000800

// Field: [9:8] IOSTR
//
// Select drive strength IO
// ENUMs:
// AUTO                 Automatic drive strength (2/4/8 mA@VDDS)
// MIN                  Minimum drive strength (2/4/8 mA@3.3V)
// MED                  Medium drive strength (2/4/8 mA@2.5V)
// MAX                  Maximum drive strength (2/4/8 mA@1.8V)
//
#define IOC_IOCFG3_IOSTR_M                                          0x00000300
#define IOC_IOCFG3_IOSTR_S                                          8
#define IOC_IOCFG3_IOSTR_AUTO                                       0x00000000
#define IOC_IOCFG3_IOSTR_MIN                                        0x00000100
#define IOC_IOCFG3_IOSTR_MED                                        0x00000200
#define IOC_IOCFG3_IOSTR_MAX                                        0x00000300

// Field: [5:0] PORT_ID
//
// Selects usage for DIO3
// ENUMs:
// GPIO                 General Purpose IO
// AON_SCS              AON SPI-S SCS
// AON_SCK              AON SPI-S SCK
// AON_SDI              AON SPI-S SDI
// AON_SDO              AON SPI-S SDO
// AON_CLK32K           AON 32 KHz clock (SCLK_LF)
// AUX_IO               AUX IO
// SSI0_RX              SSI0 RX
// SSI0_TX              SSI0 TX
// SSI0_FSS             SSI0 FSS
// SSI0_CLK             SSI0 CLK
// I2C_MSSDA            I2C Data
// I2C_MSSCL            I2C Clock
// UART0_RX             UART0 RX
// UART0_TX             UART0 TX
// UART0_CTS            UART0 CTS
// UART0_RTS            UART0 RTS
// PORT_EVENT0          PORT EVENT 0
// Can be used as a general purpose IO event by selecting it via registers in
// the EVENT module, e.g. EVENT:GPT0ACAPTSEL.EV, EVENT:UDMACH14BSEL.EV, etc
// PORT_EVENT1          PORT EVENT 1
// Can be used as a general purpose IO event by selecting it via registers in
// the EVENT module, e.g. EVENT:GPT0ACAPTSEL.EV, EVENT:UDMACH14BSEL.EV, etc
// PORT_EVENT2          PORT EVENT 2
// Can be used as a general purpose IO event by selecting it via registers in
// the EVENT module, e.g. EVENT:GPT0ACAPTSEL.EV, EVENT:UDMACH14BSEL.EV, etc
// PORT_EVENT3          PORT EVENT 3
// Can be used as a general purpose IO event by selecting it via registers in
// the EVENT module, e.g. EVENT:GPT0ACAPTSEL.EV, EVENT:UDMACH14BSEL.EV, etc
// PORT_EVENT4          PORT EVENT 4
// Can be used as a general purpose IO event by selecting it via registers in
// the EVENT module, e.g. EVENT:GPT0ACAPTSEL.EV, EVENT:UDMACH14BSEL.EV, etc
// PORT_EVENT5          PORT EVENT 5
// Can be used as a general purpose IO event by selecting it via registers in
// the EVENT module, e.g. EVENT:GPT0ACAPTSEL.EV, EVENT:UDMACH14BSEL.EV, etc
// PORT_EVENT6          PORT EVENT 6
// Can be used as a general purpose IO event by selecting it via registers in
// the EVENT module, e.g. EVENT:GPT0ACAPTSEL.EV, EVENT:UDMACH14BSEL.EV, etc
// PORT_EVENT7          PORT EVENT 7
// Can be used as a general purpose IO event by selecting it via registers in
// the EVENT module, e.g. EVENT:GPT0ACAPTSEL.EV, EVENT:UDMACH14BSEL.EV, etc
// CPU_SWV              CPU SWV
// SSI1_RX              SSI1 RX
// SSI1_TX              SSI1 TX
// SSI1_FSS             SSI1 FSS
// SSI1_CLK             SSI1 CLK
// I2S_AD0              I2S Data 0
// I2S_AD1              I2S Data 1
// I2S_WCLK             I2S WCLK
// I2S_BCLK             I2S BCLK
// I2S_MCLK             I2S MCLK
// RFC_TRC              RF Core Trace
// RFC_GPO0             RF Core Data Out 0
// RFC_GPO1             RF Core Data Out 1
// RFC_GPO2             RF Core Data Out 2
// RFC_GPO3             RF Core Data Out 3
// RFC_GPI0             RF Core Data In 0
// RFC_GPI1             RF Core Data In 1
// RFC_SMI_DL_OUT       RF Core SMI Data Link Out
// RFC_SMI_DL_IN        RF Core SMI Data Link In
// RFC_SMI_CL_OUT       RF Core SMI Command Link Out
// RFC_SMI_CL_IN        RF Core SMI Command Link In
//
#define IOC_IOCFG3_PORT_ID_M                                        0x0000003F
#define IOC_IOCFG3_PORT_ID_S                                        0
#define IOC_IOCFG3_PORT_ID_GPIO                                     0x00000000
#define IOC_IOCFG3_PORT_ID_AON_SCS                                  0x00000001
#define IOC_IOCFG3_PORT_ID_AON_SCK                                  0x00000002
#define IOC_IOCFG3_PORT_ID_AON_SDI                                  0x00000003
#define IOC_IOCFG3_PORT_ID_AON_SDO                                  0x00000004
#define IOC_IOCFG3_PORT_ID_AON_CLK32K                               0x00000007
#define IOC_IOCFG3_PORT_ID_AUX_IO                                   0x00000008
#define IOC_IOCFG3_PORT_ID_SSI0_RX                                  0x00000009
#define IOC_IOCFG3_PORT_ID_SSI0_TX                                  0x0000000A
#define IOC_IOCFG3_PORT_ID_SSI0_FSS                                 0x0000000B
#define IOC_IOCFG3_PORT_ID_SSI0_CLK                                 0x0000000C
#define IOC_IOCFG3_PORT_ID_I2C_MSSDA                                0x0000000D
#define IOC_IOCFG3_PORT_ID_I2C_MSSCL                                0x0000000E
#define IOC_IOCFG3_PORT_ID_UART0_RX                                 0x0000000F
#define IOC_IOCFG3_PORT_ID_UART0_TX                                 0x00000010
#define IOC_IOCFG3_PORT_ID_UART0_CTS                                0x00000011
#define IOC_IOCFG3_PORT_ID_UART0_RTS                                0x00000012
#define IOC_IOCFG3_PORT_ID_PORT_EVENT0                              0x00000017
#define IOC_IOCFG3_PORT_ID_PORT_EVENT1                              0x00000018
#define IOC_IOCFG3_PORT_ID_PORT_EVENT2                              0x00000019
#define IOC_IOCFG3_PORT_ID_PORT_EVENT3                              0x0000001A
#define IOC_IOCFG3_PORT_ID_PORT_EVENT4                              0x0000001B
#define IOC_IOCFG3_PORT_ID_PORT_EVENT5                              0x0000001C
#define IOC_IOCFG3_PORT_ID_PORT_EVENT6                              0x0000001D
#define IOC_IOCFG3_PORT_ID_PORT_EVENT7                              0x0000001E
#define IOC_IOCFG3_PORT_ID_CPU_SWV                                  0x00000020
#define IOC_IOCFG3_PORT_ID_SSI1_RX                                  0x00000021
#define IOC_IOCFG3_PORT_ID_SSI1_TX                                  0x00000022
#define IOC_IOCFG3_PORT_ID_SSI1_FSS                                 0x00000023
#define IOC_IOCFG3_PORT_ID_SSI1_CLK                                 0x00000024
#define IOC_IOCFG3_PORT_ID_I2S_AD0                                  0x00000025
#define IOC_IOCFG3_PORT_ID_I2S_AD1                                  0x00000026
#define IOC_IOCFG3_PORT_ID_I2S_WCLK                                 0x00000027
#define IOC_IOCFG3_PORT_ID_I2S_BCLK                                 0x00000028
#define IOC_IOCFG3_PORT_ID_I2S_MCLK                                 0x00000029
#define IOC_IOCFG3_PORT_ID_RFC_TRC                                  0x0000002E
#define IOC_IOCFG3_PORT_ID_RFC_GPO0                                 0x0000002F
#define IOC_IOCFG3_PORT_ID_RFC_GPO1                                 0x00000030
#define IOC_IOCFG3_PORT_ID_RFC_GPO2                                 0x00000031
#define IOC_IOCFG3_PORT_ID_RFC_GPO3                                 0x00000032
#define IOC_IOCFG3_PORT_ID_RFC_GPI0                                 0x00000033
#define IOC_IOCFG3_PORT_ID_RFC_GPI1                                 0x00000034
#define IOC_IOCFG3_PORT_ID_RFC_SMI_DL_OUT                           0x00000035
#define IOC_IOCFG3_PORT_ID_RFC_SMI_DL_IN                            0x00000036
#define IOC_IOCFG3_PORT_ID_RFC_SMI_CL_OUT                           0x00000037
#define IOC_IOCFG3_PORT_ID_RFC_SMI_CL_IN                            0x00000038

//*****************************************************************************
//
// Register: IOC_O_IOCFG4
//
//*****************************************************************************
// Field: [30]    HYST_EN
//
// 0: Input hysteresis disable
// 1: Input hysteresis enable
#define IOC_IOCFG4_HYST_EN                                          0x40000000
#define IOC_IOCFG4_HYST_EN_BITN                                     30
#define IOC_IOCFG4_HYST_EN_M                                        0x40000000
#define IOC_IOCFG4_HYST_EN_S                                        30

// Field: [29]    IE
//
// 0: Input disabled
// 1: Input enabled
//
// Note: If IO is configured for AUX  ie. PORT_ID = 0x08, the enable will be
// ignored.
#define IOC_IOCFG4_IE                                               0x20000000
#define IOC_IOCFG4_IE_BITN                                          29
#define IOC_IOCFG4_IE_M                                             0x20000000
#define IOC_IOCFG4_IE_S                                             29

